Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint
The Current Viewpoint in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.Changed
Occurs when the Viewpoint contained in this object has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.Changing
Occurs when the Viewpoint contained in this object is about to change.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.CopyFrom(Autodesk.Navisworks.Api.Viewpoint)
Copies the Viewpoint from viewpoint int the one in the Document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.CreateCopy
Creates a copy of the Viewpoint associated with this object

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint)~Autodesk.Navisworks.Api.Viewpoint
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.ToViewpoint
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentViewpoint.Value
The value of the current Viewpoint within the document